In [4]:
import pandas as pd
import numpy as np

In [5]:
df=pd.read_csv('CAR DETAILS FROM CAR DEKHO.csv')
df.head()

                       name  year  selling_price  km_driven    fuel seller_type transmission         owner
0             Maruti 800 AC  2007          60000      70000  Petrol  Individual       Manual   First Owner
1  Maruti Wagon R LXI Minor  2007         135000      50000  Petrol  Individual       Manual   First Owner
2      Hyundai Verna 1.6 SX  2012         600000     100000  Diesel  Individual       Manual   First Owner
3    Datsun RediGO T Option  2017         250000      46000  Petrol  Individual       Manual   First Owner
4     Honda Amaze VX i-DTEC  2014         450000     141000  Diesel  Individual       Manual  Second Owner

In [6]:
df=df[['selling_price','km_driven','year']]

In [7]:
df

      selling_price  km_driven  year
0             60000      70000  2007
1            135000      50000  2007
2            600000     100000  2012
3            250000      46000  2017
4            450000     141000  2014
...             ...        ...   ...
4335         409999      80000  2014
4336         409999      80000  2014
4337         110000      83000  2009
4338         865000      90000  2016
4339         225000      40000  2016

[4340 rows x 3 columns]

In [8]:
from sklearn.model_selection import train_test_split

In [9]:
x=df.drop('selling_price',axis=1)
y=df['selling_price']

In [10]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=42)

In [11]:
from sklearn.preprocessing import MinMaxScaler
scaler=MinMaxScaler()
x_train_scalled=scaler.fit_transform(x_train)
x_test_scalled=scaler.transform(x_test)

In [12]:
x_train_scalled

array([[0.02479426, 0.89285714],
       [0.06198751, 0.92857143],
       [0.03099313, 0.75      ],
       ...,
       [0.06322728, 0.85714286],
       [0.09918076, 0.75      ],
       [0.09918076, 0.75      ]])

In [13]:
x_test_scalled

array([[0.09918076, 0.64285714],
       [0.03347268, 0.96428571],
       [0.05172589, 0.57142857],
       ...,
       [0.04958976, 0.67857143],
       [0.0080325 , 0.89285714],
       [0.03719201, 0.96428571]])

In [14]:
x_train_scalled=pd.DataFrame(data=x_train_scalled,columns=x_train.columns)
x_test_scalled=pd.DataFrame(data=x_test_scalled,columns=x_train.columns)

In [15]:
x_train_scalled

      km_driven      year
0      0.024794  0.892857
1      0.061988  0.928571
2      0.030993  0.750000
3      0.086783  0.678571
4      0.089263  0.892857
...         ...       ...
3467   0.061988  0.500000
3468   0.099181  0.678571
3469   0.063227  0.857143
3470   0.099181  0.750000
3471   0.099181  0.750000

[3472 rows x 2 columns]

In [16]:
x_test_scalled

     km_driven      year
0     0.099181  0.642857
1     0.033473  0.964286
2     0.051726  0.571429
3     0.174807  0.785714
4     0.074385  0.857143
..         ...       ...
863   0.074385  0.535714
864   0.148772  0.821429
865   0.049590  0.678571
866   0.008033  0.892857
867   0.037192  0.964286

[868 rows x 2 columns]